448251593/stm32f407_pro/Project/STM32F4xx_b_proj/pro_src/usart_driver.h
/**
  ******************************************************************************
  * @file    USART/USART_TwoBoards/USART_DataExchangeInterrupt/main.h
  * @author  MCD Application Team
  * @version V1.8.0
  * @date    04-November-2016
  * @brief   Header for main.c module
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2016 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software
  * distributed under the License is distributed on an "AS IS" BASIS,
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __USART_DRIVER_H
#define __USART_DRIVER_H

#ifdef __cplusplus
 extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx.h"

#if defined (USE_STM324xG_EVAL)
  #include "stm324xg_eval.h"

#elif defined (USE_STM324x7I_EVAL)
  #include "stm324x7i_eval.h"

#elif defined (USE_STM324x9I_EVAL)
  #include "stm324x9i_eval.h"

#else
 #error "Please select first the Evaluation board used in your application (in Project Options)"
#endif

/* Exported typedef -----------------------------------------------------------*/
// #define countof(a)   (sizeof(a) / sizeof(*(a)))
// typedef enum {FAILED = 0, PASSED = !FAILED} TestStatus;

/* Exported define ------------------------------------------------------------*/

/* Uncomment the line below if you will use the USART in Transmitter Mode */
/* #define USART_TRANSMITTER */
/* Uncomment the line below if you will use the USART in Receiver Mode */
 #define USART_RECEIVER

/* Definition for USARTx resources ********************************************/
//#if defined (USE_STM324xG_EVAL)

#define USARTx                           USART3
#define USARTx_CLK                       RCC_APB1Periph_USART3
#define USARTx_CLK_INIT                  RCC_APB1PeriphClockCmd
#define USARTx_IRQn                      USART3_IRQn
#define USARTx_IRQHandler                USART3_IRQHandler

#define USARTx_TX_PIN                    GPIO_Pin_10
#define USARTx_TX_GPIO_PORT              GPIOB//GPIOC //add by bcg,2020-09-01 11:47:03
#define USARTx_TX_GPIO_CLK               RCC_AHB1Periph_GPIOC
#define USARTx_TX_SOURCE                 GPIO_PinSource10
#define USARTx_TX_AF                     GPIO_AF_USART3

#define USARTx_RX_PIN                    GPIO_Pin_11
#define USARTx_RX_GPIO_PORT              GPIOB//GPIOC
#define USARTx_RX_GPIO_CLK               RCC_AHB1Periph_GPIOC
#define USARTx_RX_SOURCE                 GPIO_PinSource11
#define USARTx_RX_AF                     GPIO_AF_USART3

//#endif /* USE_STM324xG_EVAL */

//#if defined (USE_STM324x7I_EVAL)

//#define USARTx                           USART3
//#define USARTx_CLK                       RCC_APB1Periph_USART3
//#define USARTx_CLK_INIT                  RCC_APB1PeriphClockCmd
//#define USARTx_IRQn                      USART3_IRQn
//#define USARTx_IRQHandler                USART3_IRQHandler

//#define USARTx_TX_PIN                    GPIO_Pin_10
//#define USARTx_TX_GPIO_PORT              GPIOC
//#define USARTx_TX_GPIO_CLK               RCC_AHB1Periph_GPIOC
//#define USARTx_TX_SOURCE                 GPIO_PinSource10
//#define USARTx_TX_AF                     GPIO_AF_USART3

//#define USARTx_RX_PIN                    GPIO_Pin_11
//#define USARTx_RX_GPIO_PORT              GPIOC
//#define USARTx_RX_GPIO_CLK               RCC_AHB1Periph_GPIOC
//#define USARTx_RX_SOURCE                 GPIO_PinSource11
//#define USARTx_RX_AF                     GPIO_AF_USART3

//#endif /* USE_STM324x7I_EVAL */

//#if defined (USE_STM324x9I_EVAL)

//#define USARTx                           USART1
//#define USARTx_CLK                       RCC_APB2Periph_USART1
//#define USARTx_CLK_INIT                  RCC_APB2PeriphClockCmd
//#define USARTx_IRQn                      USART1_IRQn
//#define USARTx_IRQHandler                USART1_IRQHandler

//#define USARTx_TX_PIN                    GPIO_Pin_9
//#define USARTx_TX_GPIO_PORT              GPIOA
//#define USARTx_TX_GPIO_CLK               RCC_AHB1Periph_GPIOA
//#define USARTx_TX_SOURCE                 GPIO_PinSource9
//#define USARTx_TX_AF                     GPIO_AF_USART1

//#define USARTx_RX_PIN                    GPIO_Pin_10
//#define USARTx_RX_GPIO_PORT              GPIOA
//#define USARTx_RX_GPIO_CLK               RCC_AHB1Periph_GPIOA
//#define USARTx_RX_SOURCE                 GPIO_PinSource10
//#define USARTx_RX_AF                     GPIO_AF_USART1

//#endif /* USE_STM324x9I_EVAL */

#define BUFFERSIZE                     100

/* Misc definition ************************************************************/
/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/* Exported macro ------------------------------------------------------------*/
/* Exported functions ------------------------------------------------------- */
extern int usart_driver_init(void);
void   systick_call_usart(void);
void  data_recv_usart(void);
#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
